       IDENTIFICATION                      DIVISION.
       PROGRAM-ID.                         PGMAUX02.
       ENVIRONMENT                         DIVISION.
       CONFIGURATION                       SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA                                DIVISION.
       LINKAGE                             SECTION.
       01  LS-DADOS-RECEBIDOS.
              05 LS-TOTALDIVIDA            PIC 9(08)V99.
              05 LS-RESP                   PIC X(01).
              05 LS-DIVIDACALC             PIC 9(08)V99.

       PROCEDURE DIVISION USING LS-DADOS-RECEBIDOS.
           MULTIPLY LS-TOTALDIVIDA BY 1,05 GIVING LS-DIVIDACALC
           MOVE 0 TO LS-RESP
           GOBACK.
